benchmarks/dockerize/history/benchmark-fastapi__2025-07-24.log
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating fast_api_wrk-hello_1 ... 
Creating fast_api_wrk-hello_1 ... done
Attaching to fast_api_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     3.97ms    1.46ms  51.39ms   71.93%
wrk-hello_1  |     Req/Sec     2.54k   323.53     3.48k    70.75%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    3.83ms
wrk-hello_1  |      75%    4.79ms
wrk-hello_1  |      90%    5.73ms
wrk-hello_1  |      99%    8.14ms
wrk-hello_1  |   607218 requests in 30.02s, 79.91MB read
wrk-hello_1  | Requests/sec:  20225.57
wrk-hello_1  | Transfer/sec:      2.66MB
fast_api_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating fast_api_wrk-order_1 ... 
Creating fast_api_wrk-order_1 ... done
Attaching to fast_api_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     7.13ms    3.45ms  63.02ms   71.61%
wrk-order_1  |     Req/Sec     1.43k   310.63     3.55k    58.43%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    6.59ms
wrk-order_1  |      75%    8.94ms
wrk-order_1  |      90%   11.65ms
wrk-order_1  |      99%   17.78ms
wrk-order_1  |   342001 requests in 30.10s, 69.80MB read
wrk-order_1  | Requests/sec:  11362.20
wrk-order_1  | Transfer/sec:      2.32MB
fast_api_wrk-order_1 exited with code 0