benchmarks/dockerize/history/benchmark-fastapi__2025-07-26.log
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating fast_api_wrk-hello_1 ... 
Creating fast_api_wrk-hello_1 ... done
Attaching to fast_api_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     4.07ms    1.77ms  47.73ms   74.28%
wrk-hello_1  |     Req/Sec     2.50k   433.74     3.57k    71.04%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    3.74ms
wrk-hello_1  |      75%    4.94ms
wrk-hello_1  |      90%    6.34ms
wrk-hello_1  |      99%    9.66ms
wrk-hello_1  |   596158 requests in 30.02s, 78.46MB read
wrk-hello_1  | Requests/sec:  19857.40
wrk-hello_1  | Transfer/sec:      2.61MB
fast_api_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating fast_api_wrk-order_1 ... 
Creating fast_api_wrk-order_1 ... done
Attaching to fast_api_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     8.23ms    3.64ms  37.22ms   68.90%
wrk-order_1  |     Req/Sec     1.23k   154.63     2.10k    75.58%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    7.85ms
wrk-order_1  |      75%   10.40ms
wrk-order_1  |      90%   13.05ms
wrk-order_1  |      99%   18.58ms
wrk-order_1  |   293729 requests in 30.03s, 59.95MB read
wrk-order_1  | Requests/sec:   9781.64
wrk-order_1  | Transfer/sec:      2.00MB
fast_api_wrk-order_1 exited with code 0