benchmarks/dockerize/history/benchmark-sanic__2025-07-24.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating sanic_wrk-hello_1 ... 
Creating sanic_wrk-hello_1 ... done
Attaching to sanic_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     2.27ms    1.14ms  19.85ms   74.24%
wrk-hello_1  |     Req/Sec     4.52k   690.16    10.33k    72.99%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    1.97ms
wrk-hello_1  |      75%    2.80ms
wrk-hello_1  |      90%    3.82ms
wrk-hello_1  |      99%    5.88ms
wrk-hello_1  |   1081092 requests in 30.10s, 118.57MB read
wrk-hello_1  | Requests/sec:  35917.24
wrk-hello_1  | Transfer/sec:      3.94MB
sanic_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating sanic_wrk-order_1 ... 
Creating sanic_wrk-order_1 ... done
Attaching to sanic_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     3.64ms    1.87ms  25.89ms   68.59%
wrk-order_1  |     Req/Sec     2.80k   667.23     5.36k    69.31%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    3.37ms
wrk-order_1  |      75%    4.73ms
wrk-order_1  |      90%    6.23ms
wrk-order_1  |      99%    8.97ms
wrk-order_1  |   670352 requests in 30.10s, 113.79MB read
wrk-order_1  | Requests/sec:  22272.22
wrk-order_1  | Transfer/sec:      3.78MB
sanic_wrk-order_1 exited with code 0