benchmarks/dockerize/history/benchmark-sanic__2025-07-26.log
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating sanic_wrk-hello_1 ... 
Creating sanic_wrk-hello_1 ... done
Attaching to sanic_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     1.80ms    1.02ms  30.34ms   78.73%
wrk-hello_1  |     Req/Sec     5.81k     0.98k   13.70k    69.70%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    1.59ms
wrk-hello_1  |      75%    2.23ms
wrk-hello_1  |      90%    3.08ms
wrk-hello_1  |      99%    5.22ms
wrk-hello_1  |   1388908 requests in 30.10s, 152.33MB read
wrk-hello_1  | Requests/sec:  46143.93
wrk-hello_1  | Transfer/sec:      5.06MB
sanic_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating sanic_wrk-order_1 ... 
Creating sanic_wrk-order_1 ... done
Attaching to sanic_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     4.04ms    2.06ms  28.59ms   67.81%
wrk-order_1  |     Req/Sec     2.52k   479.37     4.58k    80.58%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    3.77ms
wrk-order_1  |      75%    5.31ms
wrk-order_1  |      90%    6.80ms
wrk-order_1  |      99%    9.77ms
wrk-order_1  |   602291 requests in 30.02s, 102.24MB read
wrk-order_1  | Requests/sec:  20062.11
wrk-order_1  | Transfer/sec:      3.41MB
sanic_wrk-order_1 exited with code 0